app/controllers/ingredients_controller.rb

SELECT "ingredients".* FROM "ingredients"
---
  def index
    @ingredients = Ingredient.all

INSERT INTO "ingredients" ("food_name", "created_at", "updated_at", "recipe_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["food_name", "Peanut Butter"], ["created_at", "2021-11-03 18:41:01.167962"], ["updated_at", "2021-11-03 18:41:01.167962"], ["recipe_id", 4]]
---
  def create
    @ingredient = Ingredient.new(ingredient_params)

    if @ingredient.save

SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
    def set_ingredient
      @ingredient = Ingredient.find(params[:id])