app/controllers/recipes_controller.rb

  def index
    @recipes = Recipe.all
---
SELECT "recipes".* FROM "recipes"

  def create
    @recipe = Recipe.new(recipe_params)

    if @recipe.save
---
INSERT INTO "recipes" ("title", "serving_size", "image", "directions", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    if @recipe.update(recipe_params.except(:ingredients))
      @ingredients = recipe_params[:ingredients].map do |ing|
---
UPDATE "recipes" SET "directions" = $1, "updated_at" = $2 WHERE "recipes"."id" = $3  [["directions", "Place some PB and J between two pieces of bread"], ["updated_at", "2021-11-03 18:16:43.420336"], ["id", 5]]
SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."recipe_id" = $1  [["recipe_id", 25]]

  def destroy
    @recipe.destroy
---
DELETE FROM "recipes" WHERE "recipes"."id" = $1  [["id", 5]]

    def set_recipe
      @recipe = Recipe.find(params[:id])
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 25], ["LIMIT", 1]]